---
kind: method
id: M:Autodesk.Revit.DB.FamilySizeTable.AsValueString(System.Int32,System.Int32)
source: html/e750144f-6037-323f-c52b-7a16cc8dc26a.htm
---
# Autodesk.Revit.DB.FamilySizeTable.AsValueString Method

Gets the table cell value as a string.

## Syntax (C#)
```csharp
public string AsValueString(
	int row,
	int column
)
```

## Parameters
- **row** (`System.Int32`) - The table row.
- **column** (`System.Int32`) - The table column.

## Returns
The table cell value as a string.